posts/proto3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-17 Sun 14:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>How: proto3</title>
<meta name="generator" content="Org mode">
<meta name="author" content="luhuaei">

<meta name="google-site-verification" content="dVWCUwH8eYXavYgAUJtgmzwlXVIcYZeyvlUolZQVb2E" />
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="shortcut icon" type="image/x-icon" href="favicon.ico">
</head>
<body>
<div class="content-wrapper container">
   <div class="row"> <div class="col"> </div>   <div class="col-sm-6 col-md-8">
<div id="preamble" class="status">

<div class="">
    <a href="/"> Luhua.ei </a>
</div>
<ul class="">
  <li><a href="/about.html"> About Me </a> </li>
  <li><a href="https://github.com/luhuaei"> Github </a> </li>
  <li><a href="/archive.html"> Posts </a> </li>
</ul>
  <hr>
</div>
<div id="content">
<header>
<h1 class="title">How: proto3</h1>
</header><p>
<a href="https://developers.google.com/protocol-buffers/docs/proto3">proto3</a>
</p>

<div id="outline-container-org5e5b1ee" class="outline-2">
<h2 id="org5e5b1ee">style guide</h2>
<div class="outline-text-2" id="text-org5e5b1ee">
<ol class="org-ol">
<li>license</li>
<li>overview</li>
<li>syntax</li>
<li>package</li>
<li>File options</li>
<li>other</li>
</ol>
</div>
</div>

<div id="outline-container-orga87301f" class="outline-2">
<h2 id="orga87301f">声明语法</h2>
<div class="outline-text-2" id="text-orga87301f">
<pre class="example">
syntax = "proto3";
</pre>
</div>
</div>

<div id="outline-container-orgc5647b4" class="outline-2">
<h2 id="orgc5647b4">注意点:</h2>
<div class="outline-text-2" id="text-orgc5647b4">
<ol class="org-ol">
<li>信息队列编码, 1-15为单字节，16-2047为双字节，编码范围为1-2<sup>29</sup>. 在这期间
19000:19999为预留的区间，不推荐使用。</li>
</ol>
</div>
</div>

<div id="outline-container-orgd2eba8a" class="outline-2">
<h2 id="orgd2eba8a">导入其他proto文件</h2>
<div class="outline-text-2" id="text-orgd2eba8a">
<ol class="org-ol">
<li>如果具有多个文件，比如A, B, C</li>
<li>加载proto路径，通过 -I/&#x2013;proto<sub>path</sub> 指定目录</li>
</ol>
<pre class="example">
import "foo/foo.proto";

// A文件(A.proto)
import "Apple/apple.proto";

// B文件(B.proto)
import "Boy/boy.proto";
import public "A.proto";

// C文件(C.proto), C文件可以调用: A, 但不可以调用Boy/boy
import "B.proto";
</pre>
</div>
</div>

<div id="outline-container-org6b53b09" class="outline-2">
<h2 id="org6b53b09">信息(message)</h2>
<div class="outline-text-2" id="text-org6b53b09">
<ol class="org-ol">
<li>单数(singular), 接收信息范围: 0, 1， 在proto3中为默认的选择。</li>
<li>重复(repeated), 接收任何数量的信息</li>
<li>多个信息定义可以处于一个proto文件中</li>
<li>使用reserved保留关键词或者信息编码， 如2, 15, 9 to 11, "foor", "bar"</li>
<li>在message中可以使用repeated重复使用</li>
<li>支持在结构体中定义其他的结构体(nested type)</li>
</ol>
<pre class="example">
message Foo {
  repeated Bar bar = 1;
  message _Foo {
    string otherFoo = 1;
  }
  repeated _Foo foo = 2;
}
message Bar {
  string title = 1;
  string content = 2;
  repeated string name = 3;
}
</pre>
<ol class="org-ol">
<li>使用大写的驼峰式名字。结构体类型使用下划线的名字。</li>
<li>对重复的字段使用复数名称(repeated)</li>
</ol>
</div>
<div id="outline-container-org75e96b7" class="outline-3">
<h3 id="org75e96b7">信息更新</h3>
<div class="outline-text-3" id="text-org75e96b7">
<ol class="org-ol">
<li>当需要更新一个领域的结构体时，不需要重新设计，而可以在已有的领域上加入新的代
码。</li>
<li>新的代码可以解析和兼容老的代码，而老的二进制文件对新加入不能识别的地方进行忽
略。</li>
<li>可以对老的message进行移除，但更加推荐使用OBSOLUTE<sub>前缀进行标注或者使用</sub>
reserved进行预留，以便后用。</li>
<li>int32, uint32, int64, uint64, bool 之间可以相互变换，而不用考虑各个之间的兼容
性。（从int64转为int32将会被截断）。其他类型类似。</li>
<li>sint32, sint64相互兼容，但是不兼容其他类型。</li>
<li>string, bytes 是相互兼容的。</li>
<li>fixed32, sfixed32, fixed64, sfixed64 相互兼容。</li>
<li>enum(枚举值)兼容int32, uint32, int64, uint64, 不能反序列化的信息，都会保留下
来，而int类型总是保留（保留下来是值留给客户端的程序进行解码）</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org62a0b44" class="outline-2">
<h2 id="org62a0b44">默认值</h2>
<div class="outline-text-2" id="text-org62a0b44">
<p>
字符串 空字符串
字节 空字节
布尔值 false
数值型 0
枚举型 第一个元素且必须为0
</p>
</div>
</div>

<div id="outline-container-orgc50758f" class="outline-2">
<h2 id="orgc50758f">枚举型</h2>
<div class="outline-text-2" id="text-orgc50758f">
<ol class="org-ol">
<li>枚举第一个元素必须对应为0</li>
<li>在将allow<sub>alias打开后</sub>，可以给不同的key赋予相同的value</li>
<li>枚举值推荐使用32-bit的数值，</li>
<li>在反序列化中，不能识别的枚举值将会保留下来给后面的程序解析。</li>
</ol>
<pre class="example">
enum corpus {
  option allow_alias = true;
  foo = 0;
  bar = 1;
  bar2 = 1;
}
</pre>
<ol class="org-ol">
<li>使用大写的驼峰式作为名称，在结构体中使用全大写加下划线作为类型名。</li>
</ol>
</div>
</div>

<div id="outline-container-org969e529" class="outline-2">
<h2 id="org969e529">预留值</h2>
<div class="outline-text-2" id="text-org969e529">
<p>
保留特定的值，以便后面用到(不能将数值型跟字符串型混合在同一条语句上)
</p>
<pre class="example">
enum corpus {
  reserved 0, 1, 5 to 10, 1000 to max;
  reserved "Foo", "bar";
}
</pre>
</div>
</div>

<div id="outline-container-org8185559" class="outline-2">
<h2 id="org8185559">无知领域(unknown fields)</h2>
<div class="outline-text-2" id="text-org8185559">
<p>
proto3在刚开始的时候，是将不能识别的语法（区域）都抛弃，但是在3.5后，对不知的区
域信息将保留下来作为序列化输出的一部分。
</p>
</div>
</div>

<div id="outline-container-org290558c" class="outline-2">
<h2 id="org290558c">Any类型</h2>
<div class="outline-text-2" id="text-org290558c">
<p>
使用Any类型需要从google/protobuf/any.proto中导入。Any类型可以让你加入一个没有定
义的类型。(不同的语言对Any类型的解码的函数也不同)
</p>
<pre class="example">
import "google/protobuf/any.proto";
message Foo {
  string message = 1;
  repeated google.protobuf.Any details = 2;
}
</pre>
</div>
</div>

<div id="outline-container-org568d8ec" class="outline-2">
<h2 id="org568d8ec">oneof(之一类型)</h2>
<div class="outline-text-2" id="text-org568d8ec">
<ol class="org-ol">
<li>主要是可以在多个message结构中使用同一个类型。跟正规的结构类型类似，只是oneof
在多个结构之间通过分享内存共用。</li>
<li>使用case() 或者 WithOneof() 来判断是否属于oneof类型</li>
<li>oneof结构中，可以添加任何类型</li>
<li>可以在任何结构体中，添加oneof类型，除了repeated类型。</li>
</ol>
<pre class="example">
message foo {
  oneof test_foo {
    string name = 4;
  }
}
</pre>
<ol class="org-ol">
<li>如果在多处设置oneof, 将会仅仅在最后一个设置保留值，而其他的地方将会被自动清理。(?)</li>
<li>如果一个解析器对含有oneof的信息进行解析，将会最后一个遇到的oneof领域才能被用
来解析。</li>
<li>oneof 不能被repeated(4)</li>
<li>Reflection API 是通过 oneof 的原理</li>
<li>默认值将会被序列化。</li>
<li>小心删除oneof类型数据，即使一个oneof类型返回None/NOT<sub>SET</sub>，这个只能表示这个值
没有被使用或者已经被使用过。</li>
</ol>
</div>
</div>

<div id="outline-container-org9e1a055" class="outline-2">
<h2 id="org9e1a055">Map(关联表)</h2>
<div class="outline-text-2" id="text-org9e1a055">
<ol class="org-ol">
<li>key类型不能是枚举类型或浮点数，可以是整数和字符串</li>
<li>value类型可以是任何类型，除了map类型</li>
<li>下面的例子中，将表示在Project中，所有的类型都是为String类型。</li>
</ol>
<pre class="example">
map&lt;string, Project&gt; projects = 3;
</pre>
<ol class="org-ol">
<li>map类型不能repeated</li>
<li>在汇编中，map是无序的</li>
<li>在生成的proto文件，map会被排序成按key，或者数值排序。</li>
<li>从汇编中解析时，如果存在重复的key将会使用最后一个key，而如果从proto文件中解析
时，存在重复key就会报错。</li>
<li>如果一个map中有空的key，在一些语言中，会使用用默认值进行序列化，而另一些语言
中将不会进行序列化。</li>
<li>map 兼容(不兼容的可以使用以下的方法进行模拟， 两者在编译后是一样的)</li>
</ol>
<pre class="example">
message Entry {
  key_type key = 1;
  value_type value = 2;
}
repeated Entry foo = 1;
</pre>
</div>
</div>

<div id="outline-container-org627850a" class="outline-2">
<h2 id="org627850a">Package (namespace)</h2>
<div class="outline-text-2" id="text-org627850a">
<ol class="org-ol">
<li>可以使用package来避免两个文件之间的名字冲突, 不同的语音使用的实现方法也不一样。</li>
</ol>
<p>
不同的语言使用的实现方法也不一样。
</p>
<ol class="org-ol">
<li>包名应该小写</li>
</ol>
</div>
</div>

<div id="outline-container-org3304e85" class="outline-2">
<h2 id="org3304e85">Service 接口</h2>
<div class="outline-text-2" id="text-org3304e85">
<ol class="org-ol">
<li>使用在RPC服务</li>
</ol>
<pre class="example">
service SearchRequest () {
  rpc Search (SearchRequest) returns (SearchResponse);
}
</pre>
<ol class="org-ol">
<li>使用大写的驼峰式（结构名和类型名）</li>
</ol>
</div>
</div>
