posts/proto3.html

<div id="outline-container-org5d0802c" class="outline-2">
<h2 id="org5d0802c">JSON Map</h2>
<div class="outline-text-2" id="text-org5d0802c">
<ol class="org-ol">
<li>如果值为null，在编码成proto buffer时，就会替换成合适的默认值。</li>
<li>如果在proto buffer 中已经具有默认值时，将会忽略编码。</li>
</ol>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">proto3</td>
<td class="org-left">JSON</td>
<td class="org-left">JSON example</td>
<td class="org-left">Notes</td>
</tr>

<tr>
<td class="org-left">message</td>
<td class="org-left">object</td>
<td class="org-left">{"fooBar": v,"g": null,…}</td>
<td class="org-left">Generates JSON objects. Message field names are mapped to lowerCamelCase and become JSON object keys. If the json<sub>name</sub> field option is specified, the specified value will be used as the key instead. Parsers accept both the lowerCamelCase name (or the one specified by the json<sub>name</sub> option) and the original proto field name. null is an accepted value for all field types and treated as the default value of the corresponding field type.</td>
</tr>

<tr>
<td class="org-left">enum</td>
<td class="org-left">string</td>
<td class="org-left">"FOO<sub>BAR</sub>"</td>
<td class="org-left">The name of the enum value as specified in proto is used. Parsers accept both enum names and integer values.</td>
</tr>

<tr>
<td class="org-left">map&lt;K,V&gt;</td>
<td class="org-left">object</td>
<td class="org-left">{"k": v, …}</td>
<td class="org-left">All keys are converted to strings.</td>
</tr>

<tr>
<td class="org-left">repeated V</td>
<td class="org-left">array</td>
<td class="org-left">[v, …]</td>
<td class="org-left">null is accepted as the empty list [].</td>
</tr>

<tr>
<td class="org-left">bool</td>
<td class="org-left">true, false</td>
<td class="org-left">true, false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">"Hello World!"</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bytes</td>
<td class="org-left">base64 string</td>
<td class="org-left">"YWJjMTIzIT8kKiYoKSctPUB+"</td>
<td class="org-left">JSON value will be the data encoded as a string using standard base64 encoding with paddings. Either standard or URL-safe base64 encoding with/without paddings are accepted.</td>
</tr>

<tr>
<td class="org-left">int32, fixed32, uint32</td>
<td class="org-left">number</td>
<td class="org-left">1, -10, 0</td>
<td class="org-left">JSON value will be a decimal number. Either numbers or strings are accepted.</td>
</tr>

<tr>
<td class="org-left">int64, fixed64, uint64</td>
<td class="org-left">string</td>
<td class="org-left">"1", "-10"</td>
<td class="org-left">JSON value will be a decimal string. Either numbers or strings are accepted.</td>
</tr>

<tr>
<td class="org-left">float, double</td>
<td class="org-left">number</td>
<td class="org-left">1.1, -10.0, 0, "NaN", "Infinity"</td>
<td class="org-left">JSON value will be a number or one of the special string values "NaN", "Infinity", and "-Infinity". Either numbers or strings are accepted. Exponent notation is also accepted.</td>
</tr>

<tr>
<td class="org-left">Any</td>
<td class="org-left">object</td>
<td class="org-left">{"@type": "url", "f": v, … }</td>
<td class="org-left">If the Any contains a value that has a special JSON mapping, it will be converted as follows: {"@type": xxx, "value": yyy}. Otherwise, the value will be converted into a JSON object, and the "@type" field will be inserted to indicate the actual data type.</td>
</tr>

<tr>
<td class="org-left">Timestamp</td>
<td class="org-left">string</td>
<td class="org-left">"1972-01-01T10:00:20.021Z"</td>
<td class="org-left">Uses RFC 3339, where generated output will always be Z-normalized and uses 0, 3, 6 or 9 fractional digits. Offsets other than "Z" are also accepted.</td>
</tr>

<tr>
<td class="org-left">Duration</td>
<td class="org-left">string</td>
<td class="org-left">"1.000340012s", "1s"</td>
<td class="org-left">Generated output always contains 0, 3, 6, or 9 fractional digits, depending on required precision, followed by the suffix "s". Accepted are any fractional digits (also none) as long as they fit into nano-seconds precision and the suffix "s" is required.</td>
</tr>

<tr>
<td class="org-left">Struct</td>
<td class="org-left">object</td>
<td class="org-left">{ … }</td>
<td class="org-left">Any JSON object. See struct.proto.</td>
</tr>

<tr>
<td class="org-left">Wrapper types</td>
<td class="org-left">various types</td>
<td class="org-left">2, "2", "foo", true, "true", null, 0, …</td>
<td class="org-left">Wrappers use the same representation in JSON as the wrapped primitive type, except that null is allowed and preserved during data conversion and transfer.</td>
</tr>

<tr>
<td class="org-left">FieldMask</td>
<td class="org-left">string</td>
<td class="org-left">"f.fooBar,h"</td>
<td class="org-left">See field<sub>mask.proto</sub>.</td>
</tr>

<tr>
<td class="org-left">ListValue</td>
<td class="org-left">array</td>
<td class="org-left">[foo, bar, …]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Value</td>
<td class="org-left">value</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Any JSON value</td>
</tr>

<tr>
<td class="org-left">NullValue</td>
<td class="org-left">null</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JSON null</td>
</tr>

<tr>
<td class="org-left">Empty</td>
<td class="org-left">object</td>
<td class="org-left">{}</td>
<td class="org-left">An empty JSON object</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>通过添加选项来实现忽略z无知结构类型(unknown fields)</li>
</ol>
</div>
</div>
