oldorg/proto3.org.md

# JSON Map

1.  如果值为null，在编码成proto buffer时，就会替换成合适的默认值。
2.  如果在proto buffer 中已经具有默认值时，将会忽略编码。

  ------------------------ --------------- -------------------------------------------------
  proto3                   JSON            JSON example
  message                  object          {\"fooBar\": v,\"g\": null,...}
  enum                     string          \"FOO~BAR~\"
  map\<K,V\>               object          {\"k\": v, ...}
  repeated V               array           \[v, ...\]
  bool                     true, false     true, false
  string                   string          \"Hello World!\"
  bytes                    base64 string   \"YWJjMTIzIT8kKiYoKSctPUB+\"
  int32, fixed32, uint32   number          1, -10, 0
  int64, fixed64, uint64   string          \"1\", \"-10\"
  float, double            number          1.1, -10.0, 0, \"NaN\", \"Infinity\"
  Any                      object          {\"@type\": \"url\", \"f\": v, ... }
  Timestamp                string          \"1972-01-01T10:00:20.021Z\"
  Duration                 string          \"1.000340012s\", \"1s\"
  Struct                   object          { ... }
  Wrapper types            various types   2, \"2\", \"foo\", true, \"true\", null, 0, ...
  FieldMask                string          \"f.fooBar,h\"
  ListValue                array           \[foo, bar, ...\]
  Value                    value           
  NullValue                null            
  Empty                    object          {}
  ------------------------ --------------- -------------------------------------------------

1.  通过添加选项来实现忽略z无知结构类型(unknown fields)
