posts/proto3.html

<div id="outline-container-org0c32b9c" class="outline-2">
<h2 id="org0c32b9c">Options</h2>
<div class="outline-text-2" id="text-org0c32b9c">
<ol class="org-ol">
<li>一些选项是应用于文件的，应该写在文件的头部</li>
<li>一些选项是应用于结构体中，应该写在类型定义的前面。</li>
<li>导入go packge</li>
</ol>
<pre class="example">
option go_package = "../foo/bar";
</pre>
</div>
</div>
<div id="outline-container-orgb012b74" class="outline-2">
<h2 id="orgb012b74">类型表</h2>
<div class="outline-text-2" id="text-orgb012b74">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">.proto Type</td>
<td class="org-left">Notes</td>
<td class="org-left">C++ Type</td>
<td class="org-left">Java Type</td>
<td class="org-left">Python Type[2]</td>
<td class="org-left">Go Type</td>
<td class="org-left">Ruby Type</td>
<td class="org-left">C# Type</td>
<td class="org-left">PHP Type</td>
<td class="org-left">Dart Type</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">double</td>
<td class="org-left">double</td>
<td class="org-left">float</td>
<td class="org-left">float64</td>
<td class="org-left">Float</td>
<td class="org-left">double</td>
<td class="org-left">float</td>
<td class="org-left">double</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">float</td>
<td class="org-left">float</td>
<td class="org-left">float</td>
<td class="org-left">float32</td>
<td class="org-left">Float</td>
<td class="org-left">float</td>
<td class="org-left">float</td>
<td class="org-left">double</td>
</tr>

<tr>
<td class="org-left">int32</td>
<td class="org-left">Uses variable-length encoding. Inefficient for encoding negative numbers – if your field is likely to have negative values, use sint32 instead.</td>
<td class="org-left">int32</td>
<td class="org-left">int</td>
<td class="org-left">int</td>
<td class="org-left">int32</td>
<td class="org-left">Fixnum or Bignum (as required)</td>
<td class="org-left">int</td>
<td class="org-left">integer</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">int64</td>
<td class="org-left">Uses variable-length encoding. Inefficient for encoding negative numbers – if your field is likely to have negative values, use sint64 instead.</td>
<td class="org-left">int64</td>
<td class="org-left">long</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">int64</td>
<td class="org-left">Bignum</td>
<td class="org-left">long</td>
<td class="org-left">integer/string[5]</td>
<td class="org-left">Int64</td>
</tr>

<tr>
<td class="org-left">uint32</td>
<td class="org-left">Uses variable-length encoding.</td>
<td class="org-left">uint32</td>
<td class="org-left">int[1]</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">uint32</td>
<td class="org-left">Fixnum or Bignum (as required)</td>
<td class="org-left">uint</td>
<td class="org-left">integer</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">uint64</td>
<td class="org-left">Uses variable-length encoding.</td>
<td class="org-left">uint64</td>
<td class="org-left">long[1]</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">uint64</td>
<td class="org-left">Bignum</td>
<td class="org-left">ulong</td>
<td class="org-left">integer/string[5]</td>
<td class="org-left">Int64</td>
</tr>

<tr>
<td class="org-left">sint32</td>
<td class="org-left">Uses variable-length encoding. Signed int value. These more efficiently encode negative numbers than regular int32s.</td>
<td class="org-left">int32</td>
<td class="org-left">int</td>
<td class="org-left">int</td>
<td class="org-left">int32</td>
<td class="org-left">Fixnum or Bignum (as required)</td>
<td class="org-left">int</td>
<td class="org-left">integer</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">sint64</td>
<td class="org-left">Uses variable-length encoding. Signed int value. These more efficiently encode negative numbers than regular int64s.</td>
<td class="org-left">int64</td>
<td class="org-left">long</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">int64</td>
<td class="org-left">Bignum</td>
<td class="org-left">long</td>
<td class="org-left">integer/string[5]</td>
<td class="org-left">Int64</td>
</tr>

<tr>
<td class="org-left">fixed32</td>
<td class="org-left">Always four bytes. More efficient than uint32 if values are often greater than 228.</td>
<td class="org-left">uint32</td>
<td class="org-left">int[1]</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">uint32</td>
<td class="org-left">Fixnum or Bignum (as required)</td>
<td class="org-left">uint</td>
<td class="org-left">integer</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">fixed64</td>
<td class="org-left">Always eight bytes. More efficient than uint64 if values are often greater than 256.</td>
<td class="org-left">uint64</td>
<td class="org-left">long[1]</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">uint64</td>
<td class="org-left">Bignum</td>
<td class="org-left">ulong</td>
<td class="org-left">integer/string[5]</td>
<td class="org-left">Int64</td>
</tr>

<tr>
<td class="org-left">sfixed32</td>
<td class="org-left">Always four bytes.</td>
<td class="org-left">int32</td>
<td class="org-left">int</td>
<td class="org-left">int</td>
<td class="org-left">int32</td>
<td class="org-left">Fixnum or Bignum (as required)</td>
<td class="org-left">int</td>
<td class="org-left">integer</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">sfixed64</td>
<td class="org-left">Always eight bytes.</td>
<td class="org-left">int64</td>
<td class="org-left">long</td>
<td class="org-left">int/long[3]</td>
<td class="org-left">int64</td>
<td class="org-left">Bignum</td>
<td class="org-left">long</td>
<td class="org-left">integer/string[5]</td>
<td class="org-left">Int64</td>
</tr>

<tr>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bool</td>
<td class="org-left">boolean</td>
<td class="org-left">bool</td>
<td class="org-left">bool</td>
<td class="org-left">TrueClass/FalseClass</td>
<td class="org-left">bool</td>
<td class="org-left">boolean</td>
<td class="org-left">bool</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">A string must always contain UTF-8 encoded or 7-bit ASCII text, and cannot be longer than 232.</td>
<td class="org-left">string</td>
<td class="org-left">String</td>
<td class="org-left">str/unicode[4]</td>
<td class="org-left">string</td>
<td class="org-left">String (UTF-8)</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">String</td>
</tr>

<tr>
<td class="org-left">bytes</td>
<td class="org-left">May contain any arbitrary sequence of bytes no longer than 232.</td>
<td class="org-left">string</td>
<td class="org-left">ByteString</td>
<td class="org-left">str</td>
<td class="org-left">[]byte</td>
<td class="org-left">String (ASCII-8BIT)</td>
<td class="org-left">ByteString</td>
<td class="org-left">string</td>
<td class="org-left">List&lt;int&gt;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer">
      <!-- Footer Definition -->
   </footer>

  <!-- Google Analytics Js --><!-- Disqua JS -->
</div>

</div>
<div class="col"></div></div>
</div>
</body>
</html>
